app/Controllers/Admin/ContactoController.php

SELECT COUNT(*) AS `numrows`
FROM `contactos`
---
    public function total()
{
    return $this->response->setJSON([
        'total' => $this->contactoModel->countAllResults(),
    ]);