app/Models/ContactoModel.php

    public function paginar(int $page, int $perPage, array $filtros = []): array
    {
        $page    = max(1, $page);
        $perPage = max(1, min(500, $perPage));

        $this->aplicarFiltros($filtros);
        $total = $this->countAllResults(false);

        $offset = ($page - 1) * $perPage;
        $data = $this->orderBy('id', 'DESC')->findAll($perPage, $offset);
---
SELECT COUNT(*) AS `numrows`
FROM `contactos`
SELECT *
FROM `contactos`
ORDER BY `id` DESC
 LIMIT 50

    public function paisesDistintos(): array
    {
        $rows = $this->select('pais')
            ->where('pais IS NOT NULL')
            ->where('pais !=', '')
            ->groupBy('pais')
            ->orderBy('pais', 'ASC')
            ->findAll(300);
---
SELECT `pais`
FROM `contactos`
WHERE `pais` IS NOT NULL
AND `pais` != ''
GROUP BY `pais`
ORDER BY `pais` ASC
 LIMIT 300